<?php

for ($i = 1; $i <= 30; $i++){ //четко указали границу от 1 до 10
    echo  $i.'<br>'; //получается новая цифра с новой строки
}
echo '<br>'."Новый пример".'<db>';
echo '<br>';
for ($i = 1; $i <= 18; $i++){ //четко указали границу от 1 до 10
    echo  $i." "; //в кавычках добавил пробел между цифрами
}
echo '<br>'."пустая строка".'<db>';

echo '<br>'."Новый пример".'<db>';
echo '<br>';
$r = 1;
do {
    echo $r++;
} while($r <= 10);
echo '<br>'."Новый пример".'<db>';
echo '<br>';

$t = 1;
while ($t <= 10){ //пока I меньше или равно 10 выводм на экран
    echo $t++;
}
echo "закончился цикл"
//список итераций 
// 1. $1 = 1
// 2. $1 = 2
// 3. $1 = 3
// 10. $1 = 10 ($-11)*/





//Задание 2 (Виктория)

for ($i = 1; $i <= 50; $i++) {
    
    if (($i % 3) == 0) {
        if ($i % 5 != 0){
            echo "<i>" . $i . "</i>" . ' ';
        }
        else{
            echo "<b>" . "<i>" . $i . "</i>" . "</b>" . ' ';
        }
    }
    else {
        echo $i . ' ';
    }
}
?>